# Cable Type Duplicate Method

Source: https://www.revitapidocs.com/2026/d57265c5-70e8-4afa-341d-30004e15afa5.htm

---

| Cable Type Duplicate Method |
| --- |

Duplicates this Cable Type.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public CableType Duplicate()
```

```
Public Function Duplicate As CableType
```

```
public:
CableType^ Duplicate()
```

```
member Duplicate : unit -> CableType
```

#### Return Value

CableType
The duplicated Cable Type element. See Also

#### Reference

CableType Class Duplicate Overload Autodesk.Revit.DB.Electrical Namespace